pokedex-rails-backend/app/controllers/api/items_controller.rb

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        @pokemon = Pokemon.find_by(id: params[:pokemon_id])

INSERT INTO "items" ("pokemon_id", "name", "price", "happiness", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @item = Item.new(item_params)
        @item.pokemon_id = params[:pokemon_id]

        if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        @item = Item.find_by(id: params[:id])