pokedex-rails-backend/app/controllers/api/pokemon_controller.rb

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        @pokemon = Pokemon.find_by(id: params[:id])